age = int(input('请输入您的年龄：'))
has_report = input('您是否提交了体检报告？（是/否）')
level = int(input('请输入你的会员等级(1/2/3)'))
print('******⬇️程序识别的结果如下⬇️******')
if 18 <= age <= 45:
    print('✅您的年龄符合比赛要求')
    if has_report=='是':
        print('✅您已经提交体检报告！')
        if level==1:
            print(f'😊尊敬的{level}级会员，比赛结束后，您可以领取纪念T恤👕一件！')
        elif level==2:
            print(f'😊尊敬的{level}级会员，比赛结束后，您可以领取专业跑鞋👟一双！')
        else:
            print(f'😊尊敬的{level}级会员，比赛结束后，您可以领取运动耳机🎧一副！')
    elif has_report == '否':
        print('❌您未提交体检报告！')
    else:
        print('❌您输入的体检报告有误！')
else:
    print('❌抱歉，参赛年龄需要再18~45之间！')
